#+TITLE: Recursion Practice using first and rest (Exercises)
#+PROPERTY: header-args  :noweb yes 
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup  


* first and rest

  Using the destructuring assignment syntax we can get the "first element of an array" 
and "the rest of the array". I think that using "first and rest" makes it easier to think 
recursively. 

#+begin_src js :exports both :results output
let arr = [1,2,3,4]
let [first, ...rest] = arr;

console.log('first: ', first);
console.log('rest:  ', rest);
#+end_src

#+RESULTS:
: first:  1
: rest:   [ 2, 3, 4 ]

